# Brewfile
#
# Run `brew bundle` to run the brew commands listed below

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'linuxbrew/xorg'

# Perl compatible regular expressions library
brew 'pcre'

# Core application library for C
brew 'glib'

# Vector graphics library with cross-device output support
brew 'cairo'

# Cross-platform make
brew 'cmake'

# Distributed, open source, package manager for C/C++
brew 'conan'

# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'

# X11 image viewer
brew 'feh'

# Banner-like program prints strings as ASCII art
brew 'figlet'

# User-friendly command-line shell for UNIX-like operating systems
brew 'fish'

# GNU debugger
brew 'gdb'

# Distributed revision control system
brew 'git'

# Git dotfiles synchronizer written in bash
brew 'homeshick'

# Add GitHub support to git on the command-line
brew 'hub'

# Spell checker and morphological analyzer
brew 'hunspell'

# String tool
brew 'intltool'

# Open source relational database management system
brew 'mysql'

# Python version management
brew 'pyenv'

# Ruby version manager
brew 'rbenv'

# Low-level access to audio, keyboard, mouse, joystick and graphics
brew 'sdl'

# Text interface for Git repositories
brew 'tig'

# Terminal multiplexer
brew 'tmux'

# Display directories as trees (with optional color/HTML output)
brew 'tree'

# Vi 'workalike' with many additional features
brew 'vim'

# Command-line utility that is designed to run on any system with an X11
brew 'xclip'

# Fake keyboard/mouse input and window management for X
brew 'xdotool'

# XML command-line utilities
brew 'xmlstarlet'
