tap "homebrew/bundle"
tap "homebrew/core"
tap "linuxbrew/xorg"
brew "pcre"
brew "glib"
brew "linuxbrew/xorg/libx11"
brew "cairo"
brew "conan"
brew "curl"
brew "feh"
brew "figlet"
brew "fish"
brew "gdb"
brew "git"
brew "pkg-config"
brew "hub"
brew "hunspell"
brew "pyenv"
brew "rbenv"
brew "sdl"
brew "stow"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "xclip"
brew "xmlstarlet"
